generated/nova_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <ns1:erstellePreisAuskunft xmlns:ns1="http://nova.voev.ch/services/v14/preisauskunft">
      <ns1:PreisAuskunftRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ns1:kundenSegmenteGruppieren="false" xsi:type="ns1:VerbindungPreisAuskunftRequest">
        <ns1:clientIdentifier xmlns:ns3="http://nova.voev.ch/services/v14/base" ns3:leistungsVermittler="11" ns3:kanalCode="41" ns3:verkaufsStelle="16437" ns3:vertriebsPunkt="16437" ns3:verkaufsGeraeteId="236"/>
        <ns1:correlationKontext>
          <ns3:correlationId xmlns:ns3="http://nova.voev.ch/services/v14/base">87482634-560b-4da3-b6a1-155c37490fed</ns3:correlationId>
          <ns3:geschaeftsProzessId xmlns:ns3="http://nova.voev.ch/services/v14/base">1781786f-57ba-4e9a-bc29-287e2aa97f9a</ns3:geschaeftsProzessId>
        </ns1:correlationKontext>
        <ns1:angebotsFilter xmlns:ns3="http://nova.voev.ch/services/v14/vertriebsbase" xsi:type="ns3:TaxonomieFilter">
          <ns3:produktTaxonomie>Basistaxonomie</ns3:produktTaxonomie>
          <ns3:taxonomieKlassePfad>
            <ns3:klassenName>Einzelbillette</ns3:klassenName>
          </ns3:taxonomieKlassePfad>
        </ns1:angebotsFilter>
        <ns1:reisender ns1:alter="25" ns1:externeReisendenReferenzId="1234" ns1:reisendenTyp="PERSON"/>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-43B2D490-EA13-423E-B9C7-32EAA3277069_1_3">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8500218" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T12:36:00Z" ns3:ankunftsZeit="2023-04-24T13:03:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="EC" ns3:verkehrsMittelNummer="9102"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8500218" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T13:20:00Z" ns3:ankunftsZeit="2023-04-24T13:56:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="91005"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502113" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-1B893C03-E88E-4176-AF55-9EDEB01DE07C_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T13:02:00Z" ns3:ankunftsZeit="2023-04-24T13:58:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="91081"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-AAE7EAF2-7093-4831-8E6E-CB14752A6EB1_1_5">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8500218" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T13:04:00Z" ns3:ankunftsZeit="2023-04-24T13:30:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="91006"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8500218" ns3:ausstieg="8502113" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T13:35:00Z" ns3:ankunftsZeit="2023-04-24T13:44:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="RE" ns3:verkehrsMittelNummer="9101"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502113" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8502113" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T13:54:00Z" ns3:ankunftsZeit="2023-04-24T14:22:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="RE" ns3:verkehrsMittelNummer="9101"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502113" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502119" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-1AA815E8-666F-47ED-9272-6E22E2AE33AC_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T13:31:00Z" ns3:ankunftsZeit="2023-04-24T14:28:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="91001"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-66ADF40F-9A91-4A75-8D19-FAE5CD661F2C_1_3">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8502113" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T13:33:00Z" ns3:ankunftsZeit="2023-04-24T14:11:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IR" ns3:verkehrsMittelNummer="91016"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502113" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8502113" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T14:23:00Z" ns3:ankunftsZeit="2023-04-24T14:52:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IR" ns3:verkehrsMittelNummer="91037"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502113" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502119" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-B90CE393-6F7E-497A-8FC2-08F44EA04A01_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-24T13:33:00Z" ns3:ankunftsZeit="2023-04-24T14:54:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IR" ns3:verkehrsMittelNummer="91016"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502113" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500309" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503504" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
      </ns1:PreisAuskunftRequest>
    </ns1:erstellePreisAuskunft>
  </soapenv:Body>
</soapenv:Envelope>
